FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/i2s_reg.h
#define I2S_CTL0_MUTE_Pos           ( 3 )                                                  /*!< I2S_T::CTL0: MUTE Position             */
#define I2S_CTL0_MUTE_Msk           ( 0x1ul << I2S_CTL0_MUTE_Pos )                         /*!< I2S_T::CTL0: MUTE Mask                 */

#define I2S_CTL0_DATWIDTH_Pos       ( 4 )                                                  /*!< I2S_T::CTL0: DATWIDTH Position         */
#define I2S_CTL0_DATWIDTH_Msk       ( 0x3ul << I2S_CTL0_DATWIDTH_Pos )                     /*!< I2S_T::CTL0: DATWIDTH Mask             */

#define I2S_CTL0_MONO_Pos           ( 6 )                                                  /*!< I2S_T::CTL0: MONO Position             */
#define I2S_CTL0_MONO_Msk           ( 0x1ul << I2S_CTL0_MONO_Pos )                         /*!< I2S_T::CTL0: MONO Mask                 */

#define I2S_CTL0_ORDER_Pos          ( 7 )                                                  /*!< I2S_T::CTL0: ORDER Position            */
#define I2S_CTL0_ORDER_Msk          ( 0x1ul << I2S_CTL0_ORDER_Pos )                        /*!< I2S_T::CTL0: ORDER Mask                */

#define I2S_CTL0_SLAVE_Pos          ( 8 )                                                  /*!< I2S_T::CTL0: SLAVE Position            */
#define I2S_CTL0_SLAVE_Msk          ( 0x1ul << I2S_CTL0_SLAVE_Pos )                        /*!< I2S_T::CTL0: SLAVE Mask                */

#define I2S_CTL0_MCLKEN_Pos         ( 15 )                                                 /*!< I2S_T::CTL0: MCLKEN Position           */
#define I2S_CTL0_MCLKEN_Msk         ( 0x1ul << I2S_CTL0_MCLKEN_Pos )                       /*!< I2S_T::CTL0: MCLKEN Mask               */

#define I2S_CTL0_TXFBCLR_Pos        ( 18 )                                                 /*!< I2S_T::CTL0: TXFBCLR Position          */
#define I2S_CTL0_TXFBCLR_Msk        ( 0x1ul << I2S_CTL0_TXFBCLR_Pos )                      /*!< I2S_T::CTL0: TXFBCLR Mask              */

#define I2S_CTL0_RXFBCLR_Pos        ( 19 )                                                 /*!< I2S_T::CTL0: RXFBCLR Position          */
#define I2S_CTL0_RXFBCLR_Msk        ( 0x1ul << I2S_CTL0_RXFBCLR_Pos )                      /*!< I2S_T::CTL0: RXFBCLR Mask              */

#define I2S_CTL0_TXPDMAEN_Pos       ( 20 )                                                 /*!< I2S_T::CTL0: TXPDMAEN Position         */
#define I2S_CTL0_TXPDMAEN_Msk       ( 0x1ul << I2S_CTL0_TXPDMAEN_Pos )                     /*!< I2S_T::CTL0: TXPDMAEN Mask             */

#define I2S_CTL0_RXPDMAEN_Pos       ( 21 )                                                 /*!< I2S_T::CTL0: RXPDMAEN Position         */
#define I2S_CTL0_RXPDMAEN_Msk       ( 0x1ul << I2S_CTL0_RXPDMAEN_Pos )                     /*!< I2S_T::CTL0: RXPDMAEN Mask             */

#define I2S_CTL0_RXLCH_Pos          ( 23 )                                                 /*!< I2S_T::CTL0: RXLCH Position            */
#define I2S_CTL0_RXLCH_Msk          ( 0x1ul << I2S_CTL0_RXLCH_Pos )                        /*!< I2S_T::CTL0: RXLCH Mask                */

#define I2S_CTL0_FORMAT_Pos         ( 24 )                                                 /*!< I2S_T::CTL0: FORMAT Position           */
#define I2S_CTL0_FORMAT_Msk         ( 0x7ul << I2S_CTL0_FORMAT_Pos )                       /*!< I2S_T::CTL0: FORMAT Mask               */

#define I2S_CTL0_PCMSYNC_Pos        ( 27 )                                                 /*!< I2S_T::CTL0: PCMSYNC Position          */
#define I2S_CTL0_PCMSYNC_Msk        ( 0x1ul << I2S_CTL0_PCMSYNC_Pos )                      /*!< I2S_T::CTL0: PCMSYNC Mask              */

#define I2S_CTL0_CHWIDTH_Pos        ( 28 )                                                 /*!< I2S_T::CTL0: CHWIDTH Position          */
#define I2S_CTL0_CHWIDTH_Msk        ( 0x3ul << I2S_CTL0_CHWIDTH_Pos )                      /*!< I2S_T::CTL0: CHWIDTH Mask              */

#define I2S_CTL0_TDMCHNUM_Pos       ( 30 )                                                 /*!< I2S_T::CTL0: TDMCHNUM Position         */
#define I2S_CTL0_TDMCHNUM_Msk       ( 0x3ul << I2S_CTL0_TDMCHNUM_Pos )                     /*!< I2S_T::CTL0: TDMCHNUM Mask             */

#define I2S_CLKDIV_MCLKDIV_Pos      ( 0 )                                                  /*!< I2S_T::CLKDIV: MCLKDIV Position        */
#define I2S_CLKDIV_MCLKDIV_Msk      ( 0x3ful << I2S_CLKDIV_MCLKDIV_Pos )                   /*!< I2S_T::CLKDIV: MCLKDIV Mask            */

#define I2S_CLKDIV_BCLKDIV_Pos      ( 8 )                                                  /*!< I2S_T::CLKDIV: BCLKDIV Position        */
#define I2S_CLKDIV_BCLKDIV_Msk      ( 0x1fful << I2S_CLKDIV_BCLKDIV_Pos )                  /*!< I2S_T::CLKDIV: BCLKDIV Mask            */

#define I2S_IEN_RXUDFIEN_Pos        ( 0 )                                                  /*!< I2S_T::IEN: RXUDFIEN Position          */
#define I2S_IEN_RXUDFIEN_Msk        ( 0x1ul << I2S_IEN_RXUDFIEN_Pos )                      /*!< I2S_T::IEN: RXUDFIEN Mask              */

#define I2S_IEN_RXOVFIEN_Pos        ( 1 )                                                  /*!< I2S_T::IEN: RXOVFIEN Position          */
#define I2S_IEN_RXOVFIEN_Msk        ( 0x1ul << I2S_IEN_RXOVFIEN_Pos )                      /*!< I2S_T::IEN: RXOVFIEN Mask              */

#define I2S_IEN_RXTHIEN_Pos         ( 2 )                                                  /*!< I2S_T::IEN: RXTHIEN Position           */
#define I2S_IEN_RXTHIEN_Msk         ( 0x1ul << I2S_IEN_RXTHIEN_Pos )                       /*!< I2S_T::IEN: RXTHIEN Mask               */

#define I2S_IEN_TXUDFIEN_Pos        ( 8 )                                                  /*!< I2S_T::IEN: TXUDFIEN Position          */
#define I2S_IEN_TXUDFIEN_Msk        ( 0x1ul << I2S_IEN_TXUDFIEN_Pos )                      /*!< I2S_T::IEN: TXUDFIEN Mask              */

#define I2S_IEN_TXOVFIEN_Pos        ( 9 )                                                  /*!< I2S_T::IEN: TXOVFIEN Position          */
#define I2S_IEN_TXOVFIEN_Msk        ( 0x1ul << I2S_IEN_TXOVFIEN_Pos )                      /*!< I2S_T::IEN: TXOVFIEN Mask              */

