FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/i2s_reg.h
#define I2S_IEN_TXTHIEN_Pos         ( 10 )                                                 /*!< I2S_T::IEN: TXTHIEN Position           */
#define I2S_IEN_TXTHIEN_Msk         ( 0x1ul << I2S_IEN_TXTHIEN_Pos )                       /*!< I2S_T::IEN: TXTHIEN Mask               */

#define I2S_IEN_CH0ZCIEN_Pos        ( 16 )                                                 /*!< I2S_T::IEN: CH0ZCIEN Position          */
#define I2S_IEN_CH0ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH0ZCIEN_Pos )                      /*!< I2S_T::IEN: CH0ZCIEN Mask              */

#define I2S_IEN_CH1ZCIEN_Pos        ( 17 )                                                 /*!< I2S_T::IEN: CH1ZCIEN Position          */
#define I2S_IEN_CH1ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH1ZCIEN_Pos )                      /*!< I2S_T::IEN: CH1ZCIEN Mask              */

#define I2S_IEN_CH2ZCIEN_Pos        ( 18 )                                                 /*!< I2S_T::IEN: CH2ZCIEN Position          */
#define I2S_IEN_CH2ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH2ZCIEN_Pos )                      /*!< I2S_T::IEN: CH2ZCIEN Mask              */

#define I2S_IEN_CH3ZCIEN_Pos        ( 19 )                                                 /*!< I2S_T::IEN: CH3ZCIEN Position          */
#define I2S_IEN_CH3ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH3ZCIEN_Pos )                      /*!< I2S_T::IEN: CH3ZCIEN Mask              */

#define I2S_IEN_CH4ZCIEN_Pos        ( 20 )                                                 /*!< I2S_T::IEN: CH4ZCIEN Position          */
#define I2S_IEN_CH4ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH4ZCIEN_Pos )                      /*!< I2S_T::IEN: CH4ZCIEN Mask              */

#define I2S_IEN_CH5ZCIEN_Pos        ( 21 )                                                 /*!< I2S_T::IEN: CH5ZCIEN Position          */
#define I2S_IEN_CH5ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH5ZCIEN_Pos )                      /*!< I2S_T::IEN: CH5ZCIEN Mask              */

#define I2S_IEN_CH6ZCIEN_Pos        ( 22 )                                                 /*!< I2S_T::IEN: CH6ZCIEN Position          */
#define I2S_IEN_CH6ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH6ZCIEN_Pos )                      /*!< I2S_T::IEN: CH6ZCIEN Mask              */

#define I2S_IEN_CH7ZCIEN_Pos        ( 23 )                                                 /*!< I2S_T::IEN: CH7ZCIEN Position          */
#define I2S_IEN_CH7ZCIEN_Msk        ( 0x1ul << I2S_IEN_CH7ZCIEN_Pos )                      /*!< I2S_T::IEN: CH7ZCIEN Mask              */

#define I2S_STATUS0_I2SINT_Pos      ( 0 )                                                  /*!< I2S_T::STATUS0: I2SINT Position        */
#define I2S_STATUS0_I2SINT_Msk      ( 0x1ul << I2S_STATUS0_I2SINT_Pos )                    /*!< I2S_T::STATUS0: I2SINT Mask            */

#define I2S_STATUS0_I2SRXINT_Pos    ( 1 )                                                  /*!< I2S_T::STATUS0: I2SRXINT Position      */
#define I2S_STATUS0_I2SRXINT_Msk    ( 0x1ul << I2S_STATUS0_I2SRXINT_Pos )                  /*!< I2S_T::STATUS0: I2SRXINT Mask          */

#define I2S_STATUS0_I2STXINT_Pos    ( 2 )                                                  /*!< I2S_T::STATUS0: I2STXINT Position      */
#define I2S_STATUS0_I2STXINT_Msk    ( 0x1ul << I2S_STATUS0_I2STXINT_Pos )                  /*!< I2S_T::STATUS0: I2STXINT Mask          */

#define I2S_STATUS0_DATACH_Pos      ( 3 )                                                  /*!< I2S_T::STATUS0: DATACH Position        */
#define I2S_STATUS0_DATACH_Msk      ( 0x7ul << I2S_STATUS0_DATACH_Pos )                    /*!< I2S_T::STATUS0: DATACH Mask            */

#define I2S_STATUS0_RXUDIF_Pos      ( 8 )                                                  /*!< I2S_T::STATUS0: RXUDIF Position        */
#define I2S_STATUS0_RXUDIF_Msk      ( 0x1ul << I2S_STATUS0_RXUDIF_Pos )                    /*!< I2S_T::STATUS0: RXUDIF Mask            */

#define I2S_STATUS0_RXOVIF_Pos      ( 9 )                                                  /*!< I2S_T::STATUS0: RXOVIF Position        */
#define I2S_STATUS0_RXOVIF_Msk      ( 0x1ul << I2S_STATUS0_RXOVIF_Pos )                    /*!< I2S_T::STATUS0: RXOVIF Mask            */

#define I2S_STATUS0_RXTHIF_Pos      ( 10 )                                                 /*!< I2S_T::STATUS0: RXTHIF Position        */
#define I2S_STATUS0_RXTHIF_Msk      ( 0x1ul << I2S_STATUS0_RXTHIF_Pos )                    /*!< I2S_T::STATUS0: RXTHIF Mask            */

#define I2S_STATUS0_RXFULL_Pos      ( 11 )                                                 /*!< I2S_T::STATUS0: RXFULL Position        */
#define I2S_STATUS0_RXFULL_Msk      ( 0x1ul << I2S_STATUS0_RXFULL_Pos )                    /*!< I2S_T::STATUS0: RXFULL Mask            */

#define I2S_STATUS0_RXEMPTY_Pos     ( 12 )                                                 /*!< I2S_T::STATUS0: RXEMPTY Position       */
#define I2S_STATUS0_RXEMPTY_Msk     ( 0x1ul << I2S_STATUS0_RXEMPTY_Pos )                   /*!< I2S_T::STATUS0: RXEMPTY Mask           */

#define I2S_STATUS0_TXUDIF_Pos      ( 16 )                                                 /*!< I2S_T::STATUS0: TXUDIF Position        */
#define I2S_STATUS0_TXUDIF_Msk      ( 0x1ul << I2S_STATUS0_TXUDIF_Pos )                    /*!< I2S_T::STATUS0: TXUDIF Mask            */

#define I2S_STATUS0_TXOVIF_Pos      ( 17 )                                                 /*!< I2S_T::STATUS0: TXOVIF Position        */
#define I2S_STATUS0_TXOVIF_Msk      ( 0x1ul << I2S_STATUS0_TXOVIF_Pos )                    /*!< I2S_T::STATUS0: TXOVIF Mask            */

#define I2S_STATUS0_TXTHIF_Pos      ( 18 )                                                 /*!< I2S_T::STATUS0: TXTHIF Position        */
#define I2S_STATUS0_TXTHIF_Msk      ( 0x1ul << I2S_STATUS0_TXTHIF_Pos )                    /*!< I2S_T::STATUS0: TXTHIF Mask            */

#define I2S_STATUS0_TXFULL_Pos      ( 19 )                                                 /*!< I2S_T::STATUS0: TXFULL Position        */
#define I2S_STATUS0_TXFULL_Msk      ( 0x1ul << I2S_STATUS0_TXFULL_Pos )                    /*!< I2S_T::STATUS0: TXFULL Mask            */

#define I2S_STATUS0_TXEMPTY_Pos     ( 20 )                                                 /*!< I2S_T::STATUS0: TXEMPTY Position       */
#define I2S_STATUS0_TXEMPTY_Msk     ( 0x1ul << I2S_STATUS0_TXEMPTY_Pos )                   /*!< I2S_T::STATUS0: TXEMPTY Mask           */

#define I2S_STATUS0_TXBUSY_Pos      ( 21 )                                                 /*!< I2S_T::STATUS0: TXBUSY Position        */
#define I2S_STATUS0_TXBUSY_Msk      ( 0x1ul << I2S_STATUS0_TXBUSY_Pos )                    /*!< I2S_T::STATUS0: TXBUSY Mask            */

#define I2S_TXFIFO_TXFIFO_Pos       ( 0 )                                                  /*!< I2S_T::TXFIFO: TXFIFO Position         */
#define I2S_TXFIFO_TXFIFO_Msk       ( 0xfffffffful << I2S_TXFIFO_TXFIFO_Pos )              /*!< I2S_T::TXFIFO: TXFIFO Mask             */

#define I2S_RXFIFO_RXFIFO_Pos       ( 0 )                                                  /*!< I2S_T::RXFIFO: RXFIFO Position         */
#define I2S_RXFIFO_RXFIFO_Msk       ( 0xfffffffful << I2S_RXFIFO_RXFIFO_Pos )              /*!< I2S_T::RXFIFO: RXFIFO Mask             */

#define I2S_CTL1_CH0ZCEN_Pos        ( 0 )                                                  /*!< I2S_T::CTL1: CH0ZCEN Position          */
#define I2S_CTL1_CH0ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH0ZCEN_Pos )                      /*!< I2S_T::CTL1: CH0ZCEN Mask              */

#define I2S_CTL1_CH1ZCEN_Pos        ( 1 )                                                  /*!< I2S_T::CTL1: CH1ZCEN Position          */
#define I2S_CTL1_CH1ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH1ZCEN_Pos )                      /*!< I2S_T::CTL1: CH1ZCEN Mask              */

#define I2S_CTL1_CH2ZCEN_Pos        ( 2 )                                                  /*!< I2S_T::CTL1: CH2ZCEN Position          */
#define I2S_CTL1_CH2ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH2ZCEN_Pos )                      /*!< I2S_T::CTL1: CH2ZCEN Mask              */

#define I2S_CTL1_CH3ZCEN_Pos        ( 3 )                                                  /*!< I2S_T::CTL1: CH3ZCEN Position          */
#define I2S_CTL1_CH3ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH3ZCEN_Pos )                      /*!< I2S_T::CTL1: CH3ZCEN Mask              */

#define I2S_CTL1_CH4ZCEN_Pos        ( 4 )                                                  /*!< I2S_T::CTL1: CH4ZCEN Position          */
#define I2S_CTL1_CH4ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH4ZCEN_Pos )                      /*!< I2S_T::CTL1: CH4ZCEN Mask              */

#define I2S_CTL1_CH5ZCEN_Pos        ( 5 )                                                  /*!< I2S_T::CTL1: CH5ZCEN Position          */
#define I2S_CTL1_CH5ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH5ZCEN_Pos )                      /*!< I2S_T::CTL1: CH5ZCEN Mask              */

#define I2S_CTL1_CH6ZCEN_Pos        ( 6 )                                                  /*!< I2S_T::CTL1: CH6ZCEN Position          */
#define I2S_CTL1_CH6ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH6ZCEN_Pos )                      /*!< I2S_T::CTL1: CH6ZCEN Mask              */

#define I2S_CTL1_CH7ZCEN_Pos        ( 7 )                                                  /*!< I2S_T::CTL1: CH7ZCEN Position          */
#define I2S_CTL1_CH7ZCEN_Msk        ( 0x1ul << I2S_CTL1_CH7ZCEN_Pos )                      /*!< I2S_T::CTL1: CH7ZCEN Mask              */

#define I2S_CTL1_TXTH_Pos           ( 8 )                                                  /*!< I2S_T::CTL1: TXTH Position             */
#define I2S_CTL1_TXTH_Msk           ( 0xful << I2S_CTL1_TXTH_Pos )                         /*!< I2S_T::CTL1: TXTH Mask                 */

#define I2S_CTL1_RXTH_Pos           ( 16 )                                                 /*!< I2S_T::CTL1: RXTH Position             */
#define I2S_CTL1_RXTH_Msk           ( 0xful << I2S_CTL1_RXTH_Pos )                         /*!< I2S_T::CTL1: RXTH Mask                 */

#define I2S_CTL1_PBWIDTH_Pos        ( 24 )                                                 /*!< I2S_T::CTL1: PBWIDTH Position          */
#define I2S_CTL1_PBWIDTH_Msk        ( 0x1ul << I2S_CTL1_PBWIDTH_Pos )                      /*!< I2S_T::CTL1: PBWIDTH Mask              */

#define I2S_CTL1_PB16ORD_Pos        ( 25 )                                                 /*!< I2S_T::CTL1: PB16ORD Position          */
#define I2S_CTL1_PB16ORD_Msk        ( 0x1ul << I2S_CTL1_PB16ORD_Pos )                      /*!< I2S_T::CTL1: PB16ORD Mask              */

#define I2S_STATUS1_CH0ZCIF_Pos     ( 0 )                                                  /*!< I2S_T::STATUS1: CH0ZCIF Position       */
#define I2S_STATUS1_CH0ZCIF_Msk     ( 0x1ul << I2S_STATUS1_CH0ZCIF_Pos )                   /*!< I2S_T::STATUS1: CH0ZCIF Mask           */

#define I2S_STATUS1_CH1ZCIF_Pos     ( 1 )                                                  /*!< I2S_T::STATUS1: CH1ZCIF Position       */
#define I2S_STATUS1_CH1ZCIF_Msk     ( 0x1ul << I2S_STATUS1_CH1ZCIF_Pos )                   /*!< I2S_T::STATUS1: CH1ZCIF Mask           */

#define I2S_STATUS1_CH2ZCIF_Pos     ( 2 )                                                  /*!< I2S_T::STATUS1: CH2ZCIF Position       */
#define I2S_STATUS1_CH2ZCIF_Msk     ( 0x1ul << I2S_STATUS1_CH2ZCIF_Pos )                   /*!< I2S_T::STATUS1: CH2ZCIF Mask           */

